import { IoIosArrowDown } from "react-icons/io";
import { useState } from "react";
import "./style.css";

const faqData = [
  {
    id: "01",
    question: "Чи можна зробити гардеробну в маленькій кімнаті або ніші?",
    answer:
      "Так, це не проблема. Навіть невеликий простір можна продумати функціонально. Ми проєктуємо гардеробні під конкретні розміри приміщення, щоб максимально використати кожен сантиметр простору.",
  },
  {
    id: "02",
    question: "Скільки коштує гардеробна?",
    answer:
      "Вартість залежить від розміру, матеріалів, наповнення та фурнітури. Ми можемо запропонувати як більш бюджетні рішення - фабричні гардеробні з 18мм ДСП, так і преміальні варіанти з індивідуальним виконанням. Прорахунок та замір по місту - безкоштовно при замовленні у нас. Орієнтовно фабрична гардеробна розміром 1600*500*2400 коштуватиме 15000 грн., а індивідуальна 27000 грн.",
  },
  {
    id: "03",
    question: "Скільки часу займає виготовлення?",
    answer:
      "У середньому виготовлення займає від 15 до 35 днів, залежно від складності проєкту та матеріалів.",
  },
  {
    id: "04",
    question:
      "Чи можна підібрати гардеробну під стиль мого інтер'єру та в потрібних кольорах?",
    answer:
      "Звичайно. Є великий вибір декорів, кольорів, текстур, скла та профілів.",
  },
  {
    id: "05",
    question: "Що краще: фабрична гардеробна чи індивідуальна?",
    answer:
      "Індивідуальна гардеробна дозволяє максимально використати простір та врахувати всі ваші потреби. Особливо це важливо для нестандартних планувань або ніш. Фабрична гардеробна має гарну якість, але обмежену можливість зміни розмірів, тому підійде для не складних приміщень. Ціна фабричної гардеробної дешевша за індивідуальну на 50%",
  },
  {
    id: "06",
    question: "Чи можна додати підсвітку?",
    answer:
      "Так, ми можемо встановити LED-підсвітку для полиць, секцій або всієї гардеробної. Це не лише красиво, а й дуже зручно у користуванні.",
  },
  {
    id: "07",
    question: "Я переживаю, що ДСП швидко зіпсується",
    answer:
      "Ми використовуємо якісні матеріали та фурнітуру, які розраховані на щоденне використання. Гардеробна створюється для комфорту на роки. Також, на кожен наш виріб ми надаємо офіційну гарантію - 18 місяців та пост-гарантійне обслуговування.",
  },
  {
    id: "08",
    question: "Чи робите ви доставку та монтаж?",
    answer:
      "Так. Ми працюємо під ключ: доставка, занесення та професійне збирання. Ми працюємо з власною командою професійних збиральників з досвідом від 5 років!",
  },
  {
    id: "09",
    question: "Чи можна зробити гардеробну без окремої кімнати?",
    answer:
      "Так, звичайно. Гардеробну можна організувати у спальні, ніші, коридорі або навіть вздовж однієї стіни. За потреби ми можемо встановити додатково розсувну систему, щоб зонувати приміщення.",
  },
  {
    id: "10",
    question: "Чи можна спочатку побачити, як це буде виглядати?",
    answer:
      "Так, перед виготовленням ми можемо підготувати проєкт або візуалізацію, щоб ви розуміли майбутній результат ще до запуску у виробництво. Також, ви можете приїхати до нас в салон і побачити наші гардеробні вживу.",
  },
];

export function Faq() {
  const [openId, setOpenId] = useState<string | null>(null);

  return (
    <section className="faq">
      <div className="container">
        <div className="faq-top">
          <h2 className="faq-top-title">Найчастіші питання</h2>
          <div className="line"></div>
        </div>
        <div className="faq-grid">
          {faqData.map((data) => {
            const isOpen = openId === data.id;

            return (
              <div key={data.id} className={`faq-card ${isOpen ? "open" : ""}`}>
                <div
                  className="faq-card-top"
                  onClick={() =>
                    setOpenId((prev) => (prev === data.id ? null : data.id))
                  }
                  aria-expanded={isOpen}
                >
                  <div className="faq-card-top-text">
                    <span className="faq-card-top-text-count">{data.id}</span>
                    <h2 className="faq-card-top-text-title">{data.question}</h2>
                  </div>
                  <div className="faq-card-top-icon">
                    <IoIosArrowDown />
                  </div>
                </div>

                <div className="faq-card-body">
                  <div>
                    <div className="faq-card-text">{data.answer}</div>
                  </div>
                </div>
              </div>
            );
          })}
        </div>
      </div>
    </section>
  );
}
